rocksdb/experiments/M2/results/20260429-020219/budget_on/run_3/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 02:08:17 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777428497288147 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       7.247 micros/op 137991 ops/sec 36.234 seconds 5000000 operations;  136.9 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      11.994 micros/op 83377 ops/sec 59.968 seconds 5000000 operations;   82.7 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      16.073 micros/op 62216 ops/sec 80.365 seconds 5000000 operations;   61.7 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      5/0   311.47 MB   1.2      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    480.4     31.12             24.56       240    0.130       0      0       0.0       0.0
  L1     29/1    1.77 GB   6.8     27.1    14.3     12.8      23.5     10.7       0.0   1.6    258.6    224.2    107.26             91.15        17    6.309     27M  3657K       0.0       0.0
  L2     92/2    4.47 GB   1.8     17.5     8.1      9.4      13.1      3.7       0.8   1.6    273.9    204.3     65.59             55.07       113    0.580     17M  4537K       0.0       0.0
 Sum    126/3    6.54 GB   0.0     44.6    22.4     22.2      51.2     29.0       0.8   3.5    224.0    256.9    203.97            170.77       370    0.551     45M  8195K       0.0       0.0
 Int      0/0    0.00 KB   0.0     44.4    22.2     22.2      50.5     28.3       0.8   3.6    224.4    255.3    202.55            169.64       362    0.560     45M  8190K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     44.6    22.4     22.2      36.6     14.4       0.0   0.0    264.4    216.7    172.85            146.21       130    1.330     45M  8195K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    480.4     31.12             24.56       240    0.130       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 176.6 total, 173.6 interval
Flush(GB): cumulative 14.598, interval 14.172
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 51.17 GB write, 296.74 MB/s write, 44.63 GB read, 258.80 MB/s read, 204.0 seconds
Interval compaction: 50.51 GB write, 297.97 MB/s write, 44.38 GB read, 261.85 MB/s read, 202.5 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 29, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 31, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 31, total-stops: 0
interval: 31 total count
Block cache LRUCache@0x55a91f0eddf0#75514 capacity: 32.00 MB seed: 1378995155 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000164 secs_since: 176
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 176.6 total, 173.6 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 85.55 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 85.55 MB/s
Cumulative stall: 00:01:18.861 H:M:S, 44.7 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14640.22 MB, 84.35 MB/s
Interval WAL: 14M writes, 0 syncs, 14537292.00 writes per sync, written: 14.30 GB, 84.35 MB/s
Interval stall: 00:01:18.861 H:M:S, 45.4 percent
Write Stall (count): write-buffer-manager-limit-stops: 0